{
  "Downward-Facing Dog": "A foundational pose that stretches the hamstrings and calves while building strength in the shoulders.",
  "Handstand": "An inversion that builds upper body strength and enhances balance and focus.",
  "Crescent Lunge": "A high lunge that strengthens the legs and improves balance.",
  "Low Lunge": "A low lunge that stretches the thighs and groins and opens the chest.",
  "Half-Moon": "A balancing pose that strengthens the legs and improves coordination.",
  "Half Lord of the Fishes": "A seated twist that increases spinal flexibility and stimulates digestion.",
  "Half-Boat": "A core-strengthening pose that engages the abdominal muscles.",
  "Dolphin": "A forearm balance that strengthens the shoulders and core.",
  "Crescent Moon": "A high lunge that builds stamina and improves posture.",
  "Butterfly": "A seated pose that opens the hips and stretches the inner thighs.",
  "Crow": "An arm balance that strengthens the arms and wrists while improving balance.",
  "Child's Pose": "A resting pose that gently stretches the back and calms the mind.",
  "Cow": "A gentle backbend that warms up the spine and relieves tension.",
  "Wild Thing": "A heart-opening pose that stretches the chest and shoulders.",
  "Bow": "A backbend that opens the chest and strengthens the back muscles.",
  "King Pigeon": "A deep hip opener that stretches the thighs and groins.",
  "Eagle": "A balancing pose that strengthens the legs and improves concentration.",
  "Plow": "An inversion that stretches the spine and calms the nervous system.",
  "Splits": "A deep stretch for the hamstrings and groins, resembling a front split.",
  "Squat": "A squat that opens the hips and stretches the lower back.",
  "Cat": "A gentle pose that warms up the spine and relieves tension.",
  "Boat": "A core-strengthening pose that engages the abdominal muscles.",
  "Lotus": "A seated pose that promotes meditation and calms the mind.",
  "Reverse Warrior": "A side angle pose that strengthens the legs and stretches the sides.",
  "Pyramid": "A forward bend that stretches the hamstrings and improves balance.",
  "Seated Forward Bend": "A seated forward bend that stretches the spine and hamstrings.",
  "Plank": "A plank pose that strengthens the core and upper body.",
  "Forearm Stand": "A forearm balance that builds shoulder strength and balance.",
  "Sphinx": "A gentle backbend that strengthens the spine and opens the chest.",
  "Shoulder Stand": "An inversion that improves circulation and calms the mind.",
  "Bridge": "A bridge pose that stretches the chest and strengthens the back.",
  "Corpse": "A relaxation pose that calms the mind and reduces stress.",
  "Pigeon": "A reclined pigeon pose that stretches the hips and glutes.",
  "Triangle": "A standing pose that stretches the legs and opens the chest.",
  "Side Splits": "A seated pose that stretches the hamstrings and inner thighs.",
  "Wheel": "A backbend that strengthens the arms and legs.",
  "Upward-Facing Dog": "An upward-facing dog that opens the chest and strengthens the spine.",
  "Camel": "A camel pose that stretches the front of the body and improves posture.",
  "Chair": "A chair pose that strengthens the thighs and ankles.",
  "Standing Forward Bend": "A standing forward bend that stretches the hamstrings and calves.",
  "Extended Hand to Toe": "A standing balance that stretches the hamstrings.",
  "Extended Side Angle": "An extended side angle pose that stretches the sides and strengthens the legs.",
  "Side Plank": "A side plank that strengthens the arms and core.",
  "Warrior One": "A warrior pose that strengthens the legs and opens the chest.",
  "Warrior Three": "A balancing pose that strengthens the legs and improves focus.",
  "Warrior Two": "A warrior pose that strengthens the legs and improves stability.",
  "Tree": "A tree pose that improves balance and strengthens the legs."
}
